In [1]:
import numpy as np
import pandas as pd

In [3]:
datasetExample = pd.read_csv("Finaloutput of empWithHeaderDF.csv")

In [4]:
datasetExample

,Eid,Ename,Esalary,EsalaryYearly,updatedMonthlySalary,updatedSalaryYearly,Dept
0,1,Aravind,1000,12000,1100.0,13200.0,HR
1,2,Sharada,2000,24000,2100.0,25200.0,Design
2,3,Rachael,2000,24000,2100.0,25200.0,Operation
3,4,Dave,2000,24000,2100.0,25200.0,PMG
4,5,Rhema,9878,118536,9878.0,118536.0,Delivery
5,6,Rachael,9999,119988,9999.0,119988.0,Testing

In [5]:
type(datasetExample)

pandas.core.frame.DataFrame

In [6]:
# Trasvering the DF means accesing the elements
# this is same as in numpy which is with fancy indeing, index loacation..etc
# In panndas, many number of technics are there to access the elements
# 1. .head(3)
# But restrict to only one method, and become master in that.

In [7]:
# access first 3 records
# this will happen with identification of index numbers

In [8]:
# iloc method = index location -> traverse elements on the basis of row index and column index 
# ( access elements)

In [10]:
# syntax
# variation-1 : iloc(row_index, column_index)
# variation-2 : iloc(row_range, column_range) # incase of slicing
# where row_range = start value: upperbound
# upperbound = end value+1

In [13]:
datasetExample1 = datasetExample.iloc[0:3,0:7]

In [12]:
datasetExample1

,Eid,Ename,Esalary,EsalaryYearly,updatedMonthlySalary,updatedSalaryYearly,Dept
0,1,Aravind,1000,12000,1100.0,13200.0,HR
1,2,Sharada,2000,24000,2100.0,25200.0,Design
2,3,Rachael,2000,24000,2100.0,25200.0,Operation

In [14]:
datasetExample2 = datasetExample.iloc[0:3,0:]

In [15]:
datasetExample2

,Eid,Ename,Esalary,EsalaryYearly,updatedMonthlySalary,updatedSalaryYearly,Dept
0,1,Aravind,1000,12000,1100.0,13200.0,HR
1,2,Sharada,2000,24000,2100.0,25200.0,Design
2,3,Rachael,2000,24000,2100.0,25200.0,Operation

In [16]:
datasetExample2.iloc[0][1]

'Aravind'

In [21]:
# access first 2 rows with Ename,EsalaryYearly and Dept
datasetExample4 = datasetExample.iloc[0:2, [1,3,6]]

In [22]:
datasetExample4

     Ename  EsalaryYearly    Dept
0  Aravind          12000      HR
1  Sharada          24000  Design

In [24]:
# access first 2 rows with Esalary and EsalaryYearly
datasetExample3 = datasetExample.iloc[0:2, 2:4]
datasetExample3

   Esalary  EsalaryYearly
0     1000          12000
1     2000          24000

In [29]:
# access first and last rows with Esalary and EsalaryYearly
datasetExample5 = datasetExample.iloc[[0,-1], 2:4]

In [30]:
datasetExample5

   Esalary  EsalaryYearly
0     1000          12000
5     9999         119988

In [ ]:
# there is another method is loc